ci4project1/app/Controllers/UserCrud.php

SELECT *
FROM `users`
ORDER BY `id`
---
    public function index()
    {
        $usersObj = new UserModel();
        $data['myusers'] = $usersObj->orderBy('id')->findAll();

INSERT INTO `users` (`name`, `email`) VALUES ('Coke', 'onnyoaminul@gmail.com')
---
    public function store()
    {

        // helper(['form']);
        $rules = [
            'name' => 'required',   ///validation
            'email' => 'required',

        ];

        if ($this->validate($rules)) {

            $userobj = new UserModel();
            $data['name'] = $this->request->getVar('name');
            $data['email'] = $this->request->getVar('email');
            $userobj->insert($data);